kossnikita/at32f4xx-pac/src/at32f405/at32f405.svd
        <register>
          <name>HCINT15</name>
          <displayName>HCINT15</displayName>
          <description>OTGHS host channel-15 interrupt register
          (OTGHS_HCINT15)</description>
          <addressOffset>0x2E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERC</name>
              <description>Transfer completed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTD</name>
              <description>Channel halted</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received
              interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK response received
              interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK response received/transmitted
              interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYET</name>
              <description>NYET Response Received
              interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERR</name>
              <description>Transaction error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERR</name>
              <description>Babble error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUN</name>
              <description>Frame overrun</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERR</name>
              <description>Data toggle error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK0</name>
          <displayName>HCINTMSK0</displayName>
          <description>OTGHS host channel-0 mask register
          (OTGHS_HCINTMSK0)</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK1</name>
          <displayName>HCINTMSK1</displayName>
          <description>OTGHS host channel-1 mask register
          (OTGHS_HCINTMSK1)</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK2</name>
          <displayName>HCINTMSK2</displayName>
          <description>OTGHS host channel-2 mask register
          (OTGHS_HCINTMSK2)</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK3</name>
          <displayName>HCINTMSK3</displayName>
          <description>OTGHS host channel-3 mask register
          (OTGHS_HCINTMSK3)</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK4</name>
          <displayName>HCINTMSK4</displayName>
          <description>OTGHS host channel-4 mask register
          (OTGHS_HCINTMSK4)</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK5</name>
          <displayName>HCINTMSK5</displayName>
          <description>OTGHS host channel-5 mask register
          (OTGHS_HCINTMSK5)</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK6</name>
          <displayName>HCINTMSK6</displayName>
          <description>OTGHS host channel-6 mask register
          (OTGHS_HCINTMSK6)</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFERCMSK</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLMSK</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKMSK</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKMSK</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETMSK</name>
              <description>NYET Response Received
              interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XACTERRMSK</name>
              <description>Transaction error mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBLERRMSK</name>
              <description>Babble error mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMOVRUNMSK</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGLERRMSK</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
